Revit 2027 API
BRepBuilderOutcome Enumeration
 This class defines possible outcomes returned by BRepBuilder functions that need to report outcome via a return value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BRepBuilderOutcome
Public Enumeration BRepBuilderOutcome
public enum class BRepBuilderOutcome
type BRepBuilderOutcome
Members
Member name | Value | Description
Failure | 1 |  Unspecified failure. BRepBuilder object is in invalid state and should not be used.
Success | 0 |  The function has completed successfully.
See Also
Reference
Autodesk.Revit.DB Namespace